w7/w7d1/app/views/pokemon/show.json.jbuilder


unless @pokemon.toys.empty?
---
SELECT  1 AS one FROM "toys"  WHERE "toys"."pokemon_id" = $1 LIMIT 1  [["pokemon_id", 142]]
SELECT "toys".* FROM "toys"  WHERE "toys"."pokemon_id" = $1  [["pokemon_id", 142]]